/**
 ****************************************************************************************************
 * @file        key.h
 * @author      Xia
 * @version     V1.0
 * @date        2023-08-13
 * @brief       按键输入 驱动代码
 * @license     Copyright (c) 2020-2032, 广州市星翼电子科技有限公司
 ****************************************************************************************************
 * @attention
 *
 * 轮趣小车的按键驱动
 * 只有一个按键，在PA5
 *
<<<<<<< HEAD
 * 修改说明
 * V1.0 20230813
 * 第一次发布
 *
 *
=======
>>>>>>> cfa0758316210b1f15f08368ce0a9cc75cf23735
 ****************************************************************************************************
 */
 
 
#ifndef __KEY_H
#define __KEY_H

#include "./SYSTEM/sys/sys.h"

/******************************************************************************************/
/* 引脚 定义 */

#define KEY_GPIO_PORT                  GPIOA
#define KEY_GPIO_PIN                   GPIO_PIN_5
#define KEY_GPIO_CLK_ENABLE()          do{ __HAL_RCC_GPIOA_CLK_ENABLE(); }while(0)   /* PA口时钟使能 */

/******************************************************************************************/

#define KEY        HAL_GPIO_ReadPin(KEY_GPIO_PORT, KEY_GPIO_PIN)     /* 读取KEY引脚 */


#define KEY_PRES    1              /* KEY0按下 */

void key_init(void);                /* 按键初始化函数 */
uint8_t key_scan(uint8_t mode);     /* 按键扫描函数 */

#endif


















